# Рефлексия

# 10. Множество.

# 4. Метод, реализующий декартово произведение множеств.
# Сделал с небольшой ошибкой: предусмотрел вариант только для двух множеств, мог добавить возможность передавать список множеств. Ну и про рекурсию как-то не подумал, тут и без рекурсии в целом просто.

# 6. Реализуйте мульти-множество (Bag), в котором каждый элемент может присутствовать несколько раз.
# Сделал очень плохо: надо было добавить подсчет в сам класс, а не в одну функцию.

# 11. Фильтр Блюма.

# 2. Алгоритм слияния нескольких фильтров Блюма.
# Не до конца понял, как в итоге должен выглядеть алгоритм. Ошибся с вероятностью ложного срабатывания: она наоборот увеличится.

# 3. Фильтр Блюма, предусматривающий удаление элементов.
# Реализовал неправильно, без подсчёта количество добавлений для битов

# 4. Алгоритм, который анализирует конфигурацию фильтра Блюма и пытается, насколько возможно, восстановить исходное множество с учётом всех ограничений и искажений (например, коллизий, ложноположительных срабатываний...).
# Надо было сделать акцент на изучении входных данных вне кода, изучить "предметную обалсть и т.д.".
